BusinessProcesses/БПЗачисление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<BusinessProcess>
		<Properties>
			<Name>БПЗачисление</Name>
			<Comment>БП "Зачисление"</Comment>
			<Task>Task.Зачисление</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОплатаРодителей</Name>
					<Comment>Оплата родителей</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаРодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачислениеВДетскийСад</Name>
					<Comment>Зачисление в детский сад</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеВДетскийСад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/БПЗачисление/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
		
	НужноЗаписать = Ложь;
	
	Сообщить("Старт бизнес-процесса: " + """" + ЭтотОбъект.Метаданные().Синоним + """");
	

КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	   
	   НаличиеСвободныхМест = Истина;
	   Результат=НаличиеСвободныхМест;
КонецПроцедуры

Процедура ВыпискаДокументаНаОплатуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиВыпискаДокументаНаОплату(ФормируемыеЗадачи, СтандартнаяОбработка);

КонецПроцедуры

Процедура ФормированиеЗадачиВыпискаДокументаНаОплату(ФормируемыеЗадачи, СтандартнаяОбработка)
	   СтандартнаяОбработка = Ложь;
	   //Формирование задачи ВЫПИСКА СЧЕТА 
	   Задача = Задачи.Зачисление.СоздатьЗадачу();
	   Задача.Дата = ТекущаяДата();
	   Задача.БизнесПроцесс = Ссылка;
	   Задача.ТочкаМаршрута = БизнесПроцессы.БПЗачисление.ТочкиМаршрута.ВыпискаДокументаНаОплату;
	   Задача.Наименование = "Выписка документа на оплату";
	   Задача.Должность = Справочники.Должности.Бухгалтер;
	   Задача.Записать();
	   
	   ФормируемыеЗадачи.Добавить(Задача);
	   
	   //Создание ДОКУМЕНТА "ОплатаРодителей"
	   Документ = Документы.ОплатаРодителей.СоздатьДокумент();
	   Документ.Дата = ТекущаяДата();
	   Документ.Записать();
	   
	   //Запись ссылки на СЧЕТ в текущем БП
	   ОплатаРодителей = Документ.Ссылка;
	   ЭтотОбъект.Записать();
	   
	   //Запись ссылки на СЧЕТ в текущей задаче
	   Задача.ОплатаРодителей = Документ.Ссылка;
	   Задача.Записать();
	   
   КонецПроцедуры


   Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	     Результат = ОплатаРодителей.Проведен;
   КонецПроцедуры


   Процедура ПолучениеОплатыПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	     СтандартнаяОбработка = Ложь;
	   ФормированиеЗадачиПолученияОплаты(ФормируемыеЗадачи, СтандартнаяОбработка);

   КонецПроцедуры

 Процедура ФормированиеЗадачиПолученияОплаты(ФормируемыеЗадачи, СтандартнаяОбработка)
	    СтандартнаяОбработка = Ложь;
		// Формирование задачи НАЛИЧНОЙ ОПЛАТЫ
		Задача = Задачи.Зачисление.СоздатьЗадачу();
		Задача.Дата = ТекущаяДата();
		Задача.БизнесПроцесс = Ссылка;
		Задача.ТочкаМаршрута = БизнесПроцессы.БПЗачисление.ТочкиМаршрута.ПолучениеОплаты;
		Задача.Наименование = "Получение оплаты";
		
		Задача.Должность = Справочники.Должности.Бухгалтер;
		Задача.ОплатаРодителей = ОплатаРодителей;
		Задача.Записать();
		
		ФормируемыеЗадачи.Добавить(Задача);
		
		КонецПроцедуры


		Процедура ЗачислениеВДетскийСадПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)	
		   
	   СтандартнаяОбработка = Ложь;
	   ФормированиеЗадачиЗачислениеВДетскийСад(ФормируемыеЗадачи, СтандартнаяОбработка);
	 	
		КонецПроцедуры

Процедура ФормированиеЗадачиЗачислениеВДетскийСад(ФормируемыеЗадачи, СтандартнаяОбработка)
	   СтандартнаяОбработка = Ложь;
	   //Формирование задачи ВЫПИСКА СЧЕТА 
	   Задача = Задачи.Зачисление.СоздатьЗадачу();
	   Задача.Дата = ТекущаяДата();
	   Задача.БизнесПроцесс = Ссылка;
	   Задача.ТочкаМаршрута = БизнесПроцессы.БПЗачисление.ТочкиМаршрута.ЗачислениеВДетскийСад;
	   Задача.Наименование = "Зачисление в детский сад";
	   
	   Задача.Должность = Справочники.Должности.Заведующий; 
	   Задача.ОплатаРодителей = ОплатаРодителей;

	   Задача.Записать();
	   
	   ФормируемыеЗадачи.Добавить(Задача);
	   
	   //Создание ДОКУМЕНТА "ЗачислениеВДетскийСад"
	   Документ = Документы.ЗачислениеВДетскийСад.СоздатьДокумент();
	   Документ.Дата = ТекущаяДата();
	   Документ.Записать();
	   
	   //Запись ссылки на СЧЕТ в текущем БП
	   ЗачислениеВДетскийСад = Документ.Ссылка;
	   ЭтотОбъект.Записать();
	   
	   //Запись ссылки на СЧЕТ в текущей задаче
	   Задача.ЗачислениеВДетскийСад = Документ.Ссылка;
	   Задача.Записать();
	   
   КонецПроцедуры

   Процедура ЗачислениеВГруппуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	   	   
	   СтандартнаяОбработка = Ложь;
	   ФормированиеЗадачиЗачислениеВГруппу(ФормируемыеЗадачи, СтандартнаяОбработка);
	 	
   КонецПроцедуры
   
   
   	Процедура ФормированиеЗадачиЗачислениеВГруппу(ФормируемыеЗадачи, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		//Формирование задачи ОтгРУЗКИ ТОВАРА
		Задача = Задачи.Зачисление.СоздатьЗадачу();
		Задача.Дата = ТекущаяДата();
		Задача.БизнесПроцесс = Ссылка;
		Задача.ТочкаМаршрута = БизнесПроцессы.БПЗачисление.ТочкиМаршрута.ЗачислениеВГруппу;
		Задача.Наименование = "Зачисление в группу";
		
		Задача.Должность = Справочники.Должности.Воспитатель;
		Задача.ОплатаРодителей = ОплатаРодителей;
		Задача.ЗачислениеВДетскийСад = ЗачислениеВДетскийСад;
		Задача.Записать();
		
		ФормируемыеЗадачи.Добавить(Задача);
		
	КонецПроцедуры

	Процедура ЗачислениеВДетскийСадПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		Если НЕ ЗачислениеВДетскийСад.Проведен Тогда
			
			СтандартнаяОбработка = Ложь;
			Сообщить("Зачисление в детский сад не проведено ---- невозможно выполнить задачу!!!");
			Отказ = Истина;
			
		КонецЕсли;

	КонецПроцедуры

	Процедура ПолучениеОплатыПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		Если НЕ ОплатаРодителей.Проведен Тогда
			
			СтандартнаяОбработка = Ложь;
			Сообщить("Оплата родителей не проведена ---- невозможно выполнить задачу!!!");
			Отказ = Истина;
			
		КонецЕсли;
	КонецПроцедуры
